In [147]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [148]:
# Makes data frames of corresponding week data.
# The data ends with the last day of the file name.
df1 = pd.read_csv('june82019.txt')
df2 = pd.read_csv('june12019.txt')
df3 = pd.read_csv('may252019.txt')
df4 = pd.read_csv('may182019.txt')
df5 = pd.read_csv('may112019.txt')
df6 = pd.read_csv('may42019.txt')

In [149]:
# Creating Datetime column from date and time columns
df1['DATETIME'] = df1['DATE'] + ' ' + df1['TIME']
df2['DATETIME'] = df2['DATE'] + ' ' + df2['TIME']
df3['DATETIME'] = df3['DATE'] + ' ' + df3['TIME']
df4['DATETIME'] = df4['DATE'] + ' ' + df4['TIME']
df5['DATETIME'] = df5['DATE'] + ' ' + df5['TIME']
df6['DATETIME'] = df6['DATE'] + ' ' + df6['TIME']

### Converting dataframe's 'DATETIME' columns datatypes from objects to datetime

In [150]:
df1['DATETIME'] = pd.to_datetime(df1['DATETIME'])

In [151]:
df2['DATETIME'] = pd.to_datetime(df2['DATETIME'])

In [169]:
df3['DATETIME'] = pd.to_datetime(df3['DATETIME'])

In [181]:
df4['DATETIME'] = pd.to_datetime(df4['DATETIME'])

In [182]:
df5['DATETIME'] = pd.to_datetime(df5['DATETIME'])

In [183]:
df6['DATETIME'] = pd.to_datetime(df6['DATETIME'])

In [170]:
# Getting rid of unnecessary columns
df1 = df1[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]
df2 = df2[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]
df3 = df3[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]
df4 = df4[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]
df5 = df5[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]
df6 = df6[['C/A', 'UNIT', 'SCP', 'STATION','DATE', 'ENTRIES', 'DATETIME']]

In [173]:
# Creating new column for day of the week using pandas datetime function
df1['DAY_OF_WEEK'] = df1['DATETIME'].dt.day_name()
df2['DAY_OF_WEEK'] = df2['DATETIME'].dt.day_name()
df3['DAY_OF_WEEK'] = df3['DATETIME'].dt.day_name()
df4['DAY_OF_WEEK'] = df4['DATETIME'].dt.day_name()
df5['DAY_OF_WEEK'] = df5['DATETIME'].dt.day_name()
df6['DAY_OF_WEEK'] = df6['DATETIME'].dt.day_name()

In [292]:
# Cleaning data.  Getting rid of outliers
df1 = df1.loc[df1['ENTRIES'].apply(lambda x: x > 10000)]
df2 = df2.loc[df2['ENTRIES'].apply(lambda x: x > 10000 and x < 1000000)]
df3 = df3.loc[df3['ENTRIES'].apply(lambda x: x > 10000 and x < 1000000)]
df4 = df4.loc[df4['ENTRIES'].apply(lambda x: x > 10000 and x < 1000000)]
df5 = df5.loc[df5['ENTRIES'].apply(lambda x: x > 10000 and x < 1000000)]
df6 = df6.loc[df6['ENTRIES'].apply(lambda x: x > 10000 and x < 1000000)]

In [293]:
df1.head()

,C/A,UNIT,SCP,STATION,DATE,ENTRIES,DATETIME,DAY_OF_WEEK
462,A002,R051,02-06-00,59 ST,06/01/2019,212124,2019-06-01 00:00:00,Saturday
463,A002,R051,02-06-00,59 ST,06/01/2019,212146,2019-06-01 04:00:00,Saturday
464,A002,R051,02-06-00,59 ST,06/01/2019,212170,2019-06-01 08:00:00,Saturday
465,A002,R051,02-06-00,59 ST,06/01/2019,212278,2019-06-01 12:00:00,Saturday
466,A002,R051,02-06-00,59 ST,06/01/2019,212468,2019-06-01 16:00:00,Saturday

In [ ]:
df1

In [294]:
df2.head()

,C/A,UNIT,SCP,STATION,DATE,ENTRIES,DATETIME,DAY_OF_WEEK
462,A002,R051,02-06-00,59 ST,05/25/2019,204355,2019-05-25 00:00:00,Saturday
463,A002,R051,02-06-00,59 ST,05/25/2019,204368,2019-05-25 04:00:00,Saturday
464,A002,R051,02-06-00,59 ST,05/25/2019,204387,2019-05-25 08:00:00,Saturday
465,A002,R051,02-06-00,59 ST,05/25/2019,204502,2019-05-25 12:00:00,Saturday
466,A002,R051,02-06-00,59 ST,05/25/2019,204724,2019-05-25 16:00:00,Saturday

In [308]:
df1_sorted = df1.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DATE', 'DAY_OF_WEEK'], as_index=False).max()
#df2_sorted = df2.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DATE', 'DAY_OF_WEEK'], as_index=False).max()
#df3_sorted = df3.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DAY_OF_WEEK'], as_index=False).max()
#df4_sorted = df4.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DAY_OF_WEEK'], as_index=False).max()
# df5_sorted = df5.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DAY_OF_WEEK'], as_index=False).max()
# df6_sorted = df6.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DAY_OF_WEEK'], as_index=False).max()

In [309]:
df1_sorted.head()

,C/A,UNIT,SCP,STATION,DATE,DAY_OF_WEEK,ENTRIES,DATETIME
0,A002,R051,02-06-00,59 ST,06/01/2019,Saturday,212683,2019-06-01 20:00:00
1,A002,R051,02-06-00,59 ST,06/02/2019,Sunday,213241,2019-06-02 20:00:00
2,A002,R051,02-06-00,59 ST,06/03/2019,Monday,214603,2019-06-03 20:00:00
3,A002,R051,02-06-00,59 ST,06/04/2019,Tuesday,216087,2019-06-04 20:00:00
4,A002,R051,02-06-00,59 ST,06/05/2019,Wednesday,217522,2019-06-05 20:00:00

In [310]:
df1_stations = df1_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()
df2_stations = df2_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()
df3_stations = df3_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()
df4_stations = df4_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()
df5_stations = df5_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()
df6_stations = df6_sorted.groupby(['STATION', 'DAY_OF_WEEK'], as_index=False).sum()

In [311]:
df_sat_sun = df1_stations.loc[(df1_stations['DAY_OF_WEEK'] == 'Friday') | (df1_stations['DAY_OF_WEEK'] == 'Saturday')]
df_sat_sun['STATION'].value_counts()

18 ST              2
JAMAICA 179 ST     2
MORISN AV/SNDVW    2
WESTCHESTER SQ     2
15 ST-PROSPECT     2
169 ST             2
PENNSYLVANIA AV    2
BROAD ST           2
DYCKMAN ST         2
BEDFORD AV         2
191 ST             2
CONEY IS-STILLW    2
GRAND-NEWTOWN      2
170 ST             2
50 ST              2
GRAND ST           2
FAR ROCKAWAY       2
57 ST-7 AV         2
TWENTY THIRD ST    2
9TH STREET         2
168 ST             2
AVENUE N           2
BUHRE AV           2
53 ST              2
FORDHAM RD         2
GRD CNTRL-42 ST    2
ASTORIA DITMARS    2
96 ST-2 AVE        2
HOYT ST            2
207 ST             2
                  ..
B'WAY-LAFAYETTE    2
TIMES SQ-42 ST     2
W 8 ST-AQUARIUM    2
7 AV               2
4AV-9 ST           2
ROCKAWAY AV        2
CLASSON AV         2
W 4 ST-WASH SQ     2
BEACH 98 ST        2
23 ST              2
WHITLOCK AV        2
96 ST              2
CANAL ST           2
FOREST HILLS 71    2
PARK PLACE         2
25 ST              2
DEKALB AV          2
47-50 STS ROCK     2
46 ST BLISS ST     2
TREMONT AV         2
CANARSIE-ROCKAW    1
FRANKLIN AV        1
NEWARK HM HE       1
NEWARK C           1
PATH WTC 2         1
RIT-ROOSEVELT      1
5 AVE              1
NEWARK HW BMEBE    1
HARRISON           1
NEWARK BM BW       1
Name: STATION, Length: 306, dtype: int64

In [312]:
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'CANARSIE-ROCKAW']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'FRANKLIN AV']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'NEWARK HM HE']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'NEWARK C']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'PATH WTC 2']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'RIT-ROOSEVELT']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != '5 AVE']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'NEWARK HW BMEBE']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'HARRISON']
df_sat_sun = df_sat_sun[df_sat_sun.STATION != 'NEWARK BM BW']

In [327]:
df_sat_sun.loc[(df_sat_sun['STATION'] == 'CANAL ST')]

      STATION DAY_OF_WEEK  ENTRIES
975  CANAL ST      Friday  6444666
977  CANAL ST    Saturday  6840212

In [314]:
df_fri = df_sat_sun.loc[(df_sat_sun['DAY_OF_WEEK'] == 'Friday')]
df_sat = df_sat_sun.loc[(df_sat_sun['DAY_OF_WEEK'] == 'Saturday')]

In [315]:
df_fri.head(10)
df_fri_indexed = df_fri.reset_index(drop=True)
df_fri_indexed.head()

  STATION DAY_OF_WEEK  ENTRIES
0    1 AV      Friday  1203191
1  103 ST      Friday   635077
2  104 ST      Friday   946474
3  111 ST      Friday  1613618
4  116 ST      Friday  2508080

In [316]:
df_sat_indexed = df_sat.reset_index(drop=True)

In [323]:
df_fri_indexed['NET'] = df_fri_indexed['ENTRIES'] - df_sat_indexed['ENTRIES']
df_fri_indexed.head()

  STATION DAY_OF_WEEK  ENTRIES    NET
0    1 AV      Friday  1203191  30056
1  103 ST      Friday   635077   8820
2  104 ST      Friday   946474   5945
3  111 ST      Friday  1613618   7780
4  116 ST      Friday  2508080  96294

In [324]:
df_final = df_fri_indexed.sort_values(by=['NET'], ascending = False)

In [325]:
df_final

             STATION DAY_OF_WEEK   ENTRIES      NET
171   EXCHANGE PLACE      Friday   4082030   234806
37             23 ST      Friday   4827806   170604
187  GRD CNTRL-42 ST      Friday   6419410   166814
183        FULTON ST      Friday  16118121   132865
92             86 ST      Friday   6016537   108488
47   34 ST-HERALD SQ      Friday   5620048   105925
189     GROVE STREET      Friday   3907594   101913
79             72 ST      Friday   2233156    99121
4             116 ST      Friday   2508080    96294
11    14 ST-UNION SQ      Friday   4305726    93565
250  PAVONIA/NEWPORT      Friday   2845700    83504
294    WTC-CORTLANDT      Friday   3425979    79980
207   JOURNAL SQUARE      Friday   4450751    73895
103   ATL AV-BARCLAY      Friday   5845974    69238
206  JFK JAMAICA CT1      Friday   1044901    67472
286          WALL ST      Friday   6112589    65983
68             57 ST      Friday   1303441    61292
155     CORTLANDT ST      Friday   7021910    58444
48   34 ST-HUDSON YD      Friday   5144486    57889
112  B'WAY-LAFAYETTE      Friday   2531863    57456
41             28 ST      Friday   3149762    55879
76    68ST-HUNTER CO      Friday   2203782    54297
120       BEDFORD AV      Friday   1139873    53734
69        57 ST-7 AV      Friday   1261625    52786
275   TIMES SQ-42 ST      Friday   1022462    51704
274  THIRTY THIRD ST      Friday   2473805    51566
142   CATHEDRAL PKWY      Friday   1348031    47292
10             14 ST      Friday   2293065    46260
222         MARCY AV      Friday   1353242    44581
55   42 ST-BRYANT PK      Friday   1320908    43434
..               ...         ...       ...      ...
219      LONGWOOD AV      Friday    407787     1156
117      BEACH 44 ST      Friday     49216      929
38            231 ST      Friday    440603      897
131    BROAD CHANNEL      Friday    358856      787
210      KEW GARDENS      Friday    467172      598
113     BAY RIDGE AV      Friday     59176      584
81    74 ST-BROADWAY      Friday    241415      564
40             25 ST      Friday    633830      415
30              2 AV      Friday    250715      351
39            238 ST      Friday    816891      157
246       PARK PLACE      Friday    466974      118
72              6 AV      Friday    119714       69
7             125 ST      Friday    458789       18
34   21 ST-QNSBRIDGE      Friday    196665        7
244    ORCHARD BEACH      Friday    485834        1
119      BEACH 98 ST      Friday    196744        0
168         ELDER AV      Friday    262287        0
265       SIMPSON ST      Friday   1245184        0
95              9 AV      Friday    983083        0
49    34 ST-PENN STA      Friday  13547960   -11083
263   SHEEPSHEAD BAY      Friday    261550   -24962
70             59 ST      Friday   1643359   -31924
14       14TH STREET      Friday   2037437  -158265
293  WORLD TRADE CTR      Friday   4909540  -201361
139         CANAL ST      Friday   6444666  -395546
121  BEDFORD PK BLVD      Friday   2406075  -689043
214       LACKAWANNA      Friday   2380157  -894341
20            168 ST      Friday   1504417  -984148
283   VERNON-JACKSON      Friday   1071943  -997677
249     PATH NEW WTC      Friday    124525 -2906773

[296 rows x 4 columns]

In [179]:
df1_23st = df1_stations.loc[df1_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df2_23st = df2_stations.loc[df2_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df3_23st = df3_stations.loc[df3_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df4_23st = df2_stations.loc[df2_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df5_23st = df2_stations.loc[df2_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df6_23st = df2_stations.loc[df2_stations['STATION'].apply(lambda x: x in ['23 ST'])]

In [194]:
df1_23st

    STATION DAY_OF_WEEK  ENTRIES
259   23 ST      Friday  4827806
260   23 ST      Monday  4695542
261   23 ST    Saturday  4657202
262   23 ST      Sunday  4666304
263   23 ST    Thursday  4795578
264   23 ST     Tuesday  4727910
265   23 ST   Wednesday  4762119

In [196]:
df1_23st['ENTRIES'].max() - df1_23st['ENTRIES'].min()

170604

In [180]:
df3_23st

    STATION DAY_OF_WEEK  ENTRIES
259   23 ST      Friday  4490412
260   23 ST      Monday  4344402
261   23 ST    Saturday  4442037
262   23 ST      Sunday  4454726
263   23 ST    Thursday  4461652
264   23 ST     Tuesday  4386787
265   23 ST   Wednesday  4419889

In [144]:
df1_23st = df1_stations.loc[df1_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df2_23st = df2_stations.loc[df2_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df3_23st = df3_stations.loc[df3_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df4_23st = df4_stations.loc[df4_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df5_23st = df5_stations.loc[df5_stations['STATION'].apply(lambda x: x in ['23 ST'])]
df6_23st = df6_stations.loc[df6_stations['STATION'].apply(lambda x: x in ['23 ST'])]

In [142]:
#df1_23st['NET'] = df1_23st['ENTRIES'] - df2_23st['ENTRIES']
#df2_23st['NET'] = df2_23st['ENTRIES'] - df3_23st['ENTRIES']
#df3_23st['NET'] = df3_23st['ENTRIES'] - df4_23st['ENTRIES']
#df4_23st['NET'] = df4_23st['ENTRIES'] - df5_23st['ENTRIES']
#df5_23st['NET'] = df5_23st['ENTRIES'] - df6_23st['ENTRIES']

## FULTON ST

In [34]:
# Filtering data to show just the priority stations
df1_stations = df1.loc[df1['STATION'].apply(lambda x: x in ['23 ST'])]
df2_stations = df2.loc[df2['STATION'].apply(lambda x: x in ['23 ST'])]
df3_stations = df3.loc[df3['STATION'].apply(lambda x: x in ['23 ST'])]
df4_stations = df4.loc[df4['STATION'].apply(lambda x: x in ['23 ST'])]
df5_stations = df5.loc[df5['STATION'].apply(lambda x: x in ['23 ST'])]
df6_stations = df6.loc[df6['STATION'].apply(lambda x: x in ['23 ST'])]

In [13]:
#df1_stations_filtered = df1_stations.loc[df1_stations['ENTRIES'].apply(lambda x: x >= 1000)]

In [35]:
# Sorting data by each C/A, UNIT, and STATION and
#summing up the number of entries for each day of the week
df1_stations_summed = df1_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()
df2_stations_summed = df2_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()
df3_stations_summed = df3_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()
df4_stations_summed = df4_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()
df5_stations_summed = df5_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()
df6_stations_summed = df6_stations.groupby(['C/A', 'UNIT', 'STATION', 'DAY_OF_WEEK']).sum()

In [36]:
# Creating new column of NET Entries each week by substracting cumalative data 
# from the week before
df1_stations_summed['NET'] = df1_stations_summed['ENTRIES'] - df2_stations_summed['ENTRIES']
df2_stations_summed['NET'] = df2_stations_summed['ENTRIES'] - df3_stations_summed['ENTRIES']
df3_stations_summed['NET'] = df3_stations_summed['ENTRIES'] - df4_stations_summed['ENTRIES']
df4_stations_summed['NET'] = df4_stations_summed['ENTRIES'] - df5_stations_summed['ENTRIES']
df5_stations_summed['NET'] = df5_stations_summed['ENTRIES'] - df6_stations_summed['ENTRIES']

In [37]:
df1_stations_summed.head(25)

                                  ENTRIES       NET
C/A  UNIT STATION DAY_OF_WEEK
A030 R083 23 ST   Friday        803355488    538499
                  Monday        802998459    496891
                  Saturday      802892695    456281
                  Sunday        802941382    469128
                  Thursday      803264380    540609
                  Tuesday       803083119    539057
                  Wednesday     803172701    543434
A031 R083 23 ST   Friday        116576748    313044
                  Monday        116366417    295830
                  Saturday      116309628    285577
                  Sunday        116336943    287393
                  Thursday      116524371    316613
                  Tuesday       135819098  19721579
                  Wednesday     116471062    320691
N075 R111 23 ST   Friday       1542035996    187132
                  Monday       1541907654    178775
                  Saturday     1541876363    956276
                  Sunday       1541890539    172234
                  Thursday     1542003735    190154
                  Tuesday      1541938654    193723
                  Wednesday    1541970230    191968
N076 R111 23 ST   Friday        248136758    483828
                  Monday        234291875 -13087839
                  Saturday      247716200    412632
                  Sunday        206457201 -40887795

In [38]:
df2_stations_summed.head(25)

                                  ENTRIES        NET
C/A  UNIT STATION DAY_OF_WEEK
A030 R083 23 ST   Friday        802816989     445416
                  Monday        802501568     493763
                  Saturday      802436414     526440
                  Sunday        802472254     515151
                  Thursday      802723771     437941
                  Tuesday       802544062     447218
                  Wednesday     802629267     437750
A031 R083 23 ST   Friday        116263704     279966
                  Monday        116070587     301321
                  Saturday      116024051     312613
                  Sunday        116049550     308987
                  Thursday      116207758     275517
                  Tuesday       116097519     275411
                  Wednesday     116150371     272982
N075 R111 23 ST   Friday       1541848864     164924
                  Monday       1541728879     180842
                  Saturday     1540920087    -594329
                  Sunday       1541718305     187979
                  Thursday     1541813581     162451
                  Tuesday      1541744931  257091115
                  Wednesday    1541778262     160551
N076 R111 23 ST   Friday        247652930     418060
                  Monday        247379714     479911
                  Saturday      247303568     509426
                  Sunday        247344996     497655

In [39]:
df3_stations_summed.head(25)

                                  ENTRIES        NET
C/A  UNIT STATION DAY_OF_WEEK
A030 R083 23 ST   Friday        802371573     540715
                  Monday        802007805     547520
                  Saturday      801909974     534816
                  Sunday        801957103     539784
                  Thursday      802285830     544392
                  Tuesday       802096844     541172
                  Wednesday     802191517     541688
A031 R083 23 ST   Friday        115983738     321812
                  Monday        115769266     339923
                  Saturday      115711438     334793
                  Sunday        115740563     336043
                  Thursday      115932241     329306
                  Tuesday       115822108     337599
                  Wednesday     115877389     333572
N075 R111 23 ST   Friday       1541683940     199518
                  Monday       1541548037     208404
                  Saturday     1541514416     204752
                  Sunday       1541530326     206458
                  Thursday     1541651130     203113
                  Tuesday      1284653816 -256720763
                  Wednesday    1541617711     206038
N076 R111 23 ST   Friday        247234870     515824
                  Monday        246899803     517350
                  Saturday      246794142     503326
                  Sunday        246847341     509689